Revit 2026 API

# PipeSetSystemType Method

---

Updates the associated system type for the pipe.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSystemType(
	ElementId systemTypeId
)
```
```vb
Public Sub SetSystemType (
	systemTypeId As ElementId
)
```
```cpp
public:
void SetSystemType(
	ElementId^ systemTypeId
)
```
```fsharp
member SetSystemType :
        systemTypeId : ElementId -> unit
```

#### Parameters

systemTypeId ElementId
     The ElementId of the piping system type.

| Exception | Condition |
| --- | --- |
| ArgumentException | The systemTypeId is not valid piping system type. |
| ArgumentNullException | A non-optional argument was null |

If the pipe previously did not have a system associated to it, this will create a new system.

#### Reference

Pipe Class

Autodesk.Revit.DB.Plumbing Namespace